#### Terraform Format and Style  - `success`
#### Terraform Initialization - `success`
#### Terraform Plan - `success`          

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.remote["current"]: Reading...
module.landingzone.module.resource_groups["hub-rg"].azurecaf_name.rg: Refreshing state... [id=eirjekyaalyhijyy]
data.terraform_remote_state.remote["current"]: Read complete after 1s
module.landingzone.data.azurerm_client_config.current: Reading...
module.landingzone.data.azurerm_subscription.primary: Reading...
module.landingzone.module.resource_groups["hub-rg"].azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/conn-hub-rg]
module.landingzone.data.azurerm_client_config.current: Read complete after 0s [id=2023-03-22 07:17:22.053167876 +0000 UTC]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Reading...
module.landingzone.data.azurerm_subscription.primary: Read complete after 0s [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2023-03-22 07:17:22.18112727 +0000 UTC]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Read complete after 1s [id=2b3020e2-22c9-4b01-b88e-95624dbd2f23]
module.landingzone.module.networking["hub_vnet"].module.nsg.azurecaf_name.nsg_obj["jumpbox"]: Refreshing state... [id=alfvghomtrnkrijd]
module.landingzone.module.networking["hub_vnet"].azurecaf_name.caf_name_vnet: Refreshing state... [id=xhctqcesrjqoaueq]
module.landingzone.module.networking["hub_vnet"].module.subnets["private_endpoints"].azurecaf_name.subnet: Refreshing state... [id=ofyebelyvlwtbsob]
module.landingzone.module.networking["hub_vnet"].module.subnets["jumpbox"].azurecaf_name.subnet: Refreshing state... [id=nldjxtayojnsrndj]
module.landingzone.module.networking["hub_vnet"].module.special_subnets["GatewaySubnet"].azurecaf_name.subnet: Refreshing state... [id=jcgimfwprrdcyvtd]
module.landingzone.module.networking["hub_vnet"].module.special_subnets["AzureFirewallSubnet"].azurecaf_name.subnet: Refreshing state... [id=rueodohgdrtajxma]
module.landingzone.module.networking["hub_vnet"].azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/conn-hub-rg/providers/Microsoft.Network/virtualNetworks/mm-vnet-hub]
module.landingzone.module.networking["hub_vnet"].module.nsg.azurerm_network_security_group.nsg_obj["jumpbox"]: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/conn-hub-rg/providers/Microsoft.Network/networkSecurityGroups/jumpbox]
module.landingzone.module.networking["hub_vnet"].module.subnets["private_endpoints"].azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/conn-hub-rg/providers/Microsoft.Network/virtualNetworks/mm-vnet-hub/subnets/private_endpoints]
module.landingzone.module.networking["hub_vnet"].module.special_subnets["GatewaySubnet"].azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/conn-hub-rg/providers/Microsoft.Network/virtualNetworks/mm-vnet-hub/subnets/GatewaySubnet]
module.landingzone.module.networking["hub_vnet"].module.special_subnets["AzureFirewallSubnet"].azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/conn-hub-rg/providers/Microsoft.Network/virtualNetworks/mm-vnet-hub/subnets/AzureFirewallSubnet]
module.landingzone.module.networking["hub_vnet"].module.subnets["jumpbox"].azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/conn-hub-rg/providers/Microsoft.Network/virtualNetworks/mm-vnet-hub/subnets/jumpbox]
module.landingzone.module.networking["hub_vnet"].azurerm_subnet_network_security_group_association.nsg_vnet_association["jumpbox"]: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/conn-hub-rg/providers/Microsoft.Network/virtualNetworks/mm-vnet-hub/subnets/jumpbox]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.landingzone.module.resource_groups["hub-rg"].azurerm_resource_group.rg has changed
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/conn-hub-rg"
        name     = "conn-hub-rg"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.landingzone.module.networking["hub_vnet"].azurecaf_name.caf_name_vnet must be replaced
+/- resource "azurecaf_name" "caf_name_vnet" {
      ~ id            = "xhctqcesrjqoaueq" -> (known after apply)
      ~ name          = "mm-vnet-hub" -> "dvt-vnet-hub" # forces replacement
      ~ result        = "mm-vnet-hub" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ objects         = (sensitive value)

Warning: Value for undeclared variable

The root module does not declare a variable named
"network_security_group_definition" but a value was found in file
"../../landingzones/core/connectivity/network_security.tfvars". If you meant
to use this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Argument is deprecated

  with module.landingzone.module.api_management_custom_domain.azurerm_api_management_custom_domain.apim,
  on ../dvt-caf/modules/apim/api_management_custom_domain/module.tf line 1, in resource "azurerm_api_management_custom_domain" "apim":
   1: resource "azurerm_api_management_custom_domain" "apim" {

`proxy` is deprecated and will be renamed to `gateway` in version 3.0 of the
AzureRM provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @rafaelherik, Action: `pull_request`*